#Область ПубличныйИнтерфейс

Функция ВерсияПротокола() Экспорт
    Возврат "v1";
КонецФункции

Функция ИсточникДанных() Экспорт
    Возврат "1c-enterprise";
КонецФункции

Функция СостоянияОбязательств() Экспорт
    Результат = Новый Массив;
    Результат.Добавить("created");
    Результат.Добавить("active");
    Результат.Добавить("partially_settled");
    Результат.Добавить("locked");
    Результат.Добавить("settled");
    Результат.Добавить("cancelled");
    Возврат Результат;
КонецФункции

Функция СостоянияРаспоряжений() Экспорт
    Результат = Новый Массив;
    Результат.Добавить("pending");
    Результат.Добавить("locked");
    Результат.Добавить("settled");
    Результат.Добавить("expired");
    Результат.Добавить("cancelled");
    Возврат Результат;
КонецФункции

#КонецОбласти
